doc/CA-PostingEntityPreSave-wsdl.xml

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" name="PostingEntityInterfaceService" targetNamespace="http://tempuri.org/">
  <wsp:Policy wsu:Id="WSHttpBinding_IPostingEntityInterfaceService_policy">
    <wsp:ExactlyOne>
      <wsp:All>
        <sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <wsp:Policy>
            <sp:TransportToken>
              <wsp:Policy>
                <sp:HttpsToken RequireClientCertificate="false"/>
              </wsp:Policy>
            </sp:TransportToken>
            <sp:AlgorithmSuite>
              <wsp:Policy>
                <sp:Basic256/>
              </wsp:Policy>
            </sp:AlgorithmSuite>
            <sp:Layout>
              <wsp:Policy>
                <sp:Strict/>
              </wsp:Policy>
            </sp:Layout>
          </wsp:Policy>
        </sp:TransportBinding>
        <wsaw:UsingAddressing/>
      </wsp:All>
    </wsp:ExactlyOne>
  </wsp:Policy>
	<wsdl:types>
    <xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://tempuri.org/" elementFormDefault="qualified" targetNamespace="http://tempuri.org/">
      <xs:element name="GetTokenNumber">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" maxOccurs="1" name="postingEntity" type="tns:PostingEntity"/>
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:complexType name="PostingEntity">
        <xs:sequence>
          <xs:element minOccurs="0" maxOccurs="1" name="PostingAgencyKey" type="xs:string"/>
          <xs:element minOccurs="1" maxOccurs="1" name="VoterResidentType" type="xs:int"/>
          <xs:element minOccurs="1" maxOccurs="1" name="IsUsCitizen" type="xs:boolean"/>
          <xs:element minOccurs="1" maxOccurs="1" name="IsEighteenOrOlder" type="xs:boolean"/>
          <xs:element minOccurs="1" maxOccurs="1" name="IsDisclosureDisplayed" type="xs:boolean"/>
          <xs:element minOccurs="1" maxOccurs="1" name="DobDay" type="xs:int"/>
          <xs:element minOccurs="1" maxOccurs="1" name="DobMonth" type="xs:int"/>
          <xs:element minOccurs="1" maxOccurs="1" name="DobYear" type="xs:int"/>
          <xs:element minOccurs="1" maxOccurs="1" name="PrefixId" type="xs:int"/>
          <xs:element minOccurs="0" maxOccurs="1" name="CurrentFirstName" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="CurrentMiddleName" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="CurrentLastName" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="PreviousFirstName" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="PreviousMiddleName" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="PreviousLastName" type="xs:string"/>
          <xs:element minOccurs="1" maxOccurs="1" name="IsHomeAddress" type="xs:boolean"/>
          <xs:element minOccurs="0" maxOccurs="1" name="HomeAddressStreetLine1" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="HomeAddressStreetLine2" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="HomeAddressCity" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="HomeAddressState" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="HomeAddressZip" type="xs:string"/>
          <xs:element minOccurs="1" maxOccurs="1" name="IsMailingAddress" type="xs:boolean"/>
          <xs:element minOccurs="0" maxOccurs="1" name="MailingAddressStreetLine1" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="MailingAddressStreetLine2" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="MailingAddressCity" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="MailingAddressState" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="MailingAddressZip" type="xs:string"/>
          <xs:element minOccurs="1" maxOccurs="1" name="IsPreviouslyRegistered" type="xs:boolean"/>
          <xs:element minOccurs="0" maxOccurs="1" name="PreviousAddressStreetLine1" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="PreviousAddressStreetLine2" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="PreviousAddressCity" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="PreviousAddressState" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="PreviousAddressZip" type="xs:string"/>
          <xs:element minOccurs="1" maxOccurs="1" name="IsNonUspsAddress" type="xs:boolean"/>
          <xs:element minOccurs="0" maxOccurs="1" name="NonUspsAddressDescription" type="xs:string"/>
          <xs:element minOccurs="1" maxOccurs="1" name="DobStateId" type="xs:int"/>
          <xs:element minOccurs="1" maxOccurs="1" name="DobCountryId" type="xs:int"/>
          <xs:element minOccurs="0" maxOccurs="1" name="PhoneNumber" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="EmailId" type="xs:string"/>
          <xs:element minOccurs="0" maxOccurs="1" name="EmailIdConfirmation" type="xs:string"/>
          <xs:element minOccurs="1" maxOccurs="1" name="EthnicityId" type="xs:int"/>
          <xs:element minOccurs="1" maxOccurs="1" name="ElectionMaterialLanguageId" type="xs:int"/>
        </xs:sequence>
      </xs:complexType>
      <xs:element name="GetTokenNumberResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" maxOccurs="1" name="GetTokenNumberResult" type="tns:PostingEntityToken"/>
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:complexType name="PostingEntityToken">
        <xs:sequence>
          <xs:element minOccurs="0" maxOccurs="1" name="Token" type="xs:string"/>
          <xs:element minOccurs="1" maxOccurs="1" name="Success" type="xs:boolean"/>
          <xs:element minOccurs="1" maxOccurs="1" name="ErrorCode" type="xs:int"/>
          <xs:element minOccurs="0" maxOccurs="1" name="ErrorMessage" type="xs:string"/>
        </xs:sequence>
      </xs:complexType>
		</xs:schema>
		<xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/">
			<xs:element name="anyType" nillable="true" type="xs:anyType"/>
			<xs:element name="anyURI" nillable="true" type="xs:anyURI"/>
			<xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/>
			<xs:element name="boolean" nillable="true" type="xs:boolean"/>
			<xs:element name="byte" nillable="true" type="xs:byte"/>
			<xs:element name="dateTime" nillable="true" type="xs:dateTime"/>
			<xs:element name="decimal" nillable="true" type="xs:decimal"/>
			<xs:element name="double" nillable="true" type="xs:double"/>
			<xs:element name="float" nillable="true" type="xs:float"/>
			<xs:element name="int" nillable="true" type="xs:int"/>
			<xs:element name="long" nillable="true" type="xs:long"/>
			<xs:element name="QName" nillable="true" type="xs:QName"/>
			<xs:element name="short" nillable="true" type="xs:short"/>
			<xs:element name="string" nillable="true" type="xs:string"/>
			<xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/>
			<xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/>
			<xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/>
			<xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/>
			<xs:element name="char" nillable="true" type="tns:char"/>
			<xs:simpleType name="char">
				<xs:restriction base="xs:int"/>
			</xs:simpleType>
			<xs:element name="duration" nillable="true" type="tns:duration"/>
			<xs:simpleType name="duration">
				<xs:restriction base="xs:duration">
					<xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/>
					<xs:minInclusive value="-P10675199DT2H48M5.4775808S"/>
					<xs:maxInclusive value="P10675199DT2H48M5.4775807S"/>
				</xs:restriction>
			</xs:simpleType>
			<xs:element name="guid" nillable="true" type="tns:guid"/>
			<xs:simpleType name="guid">
				<xs:restriction base="xs:string">
					<xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/>
				</xs:restriction>
			</xs:simpleType>
			<xs:attribute name="FactoryType" type="xs:QName"/>
			<xs:attribute name="Id" type="xs:ID"/>
			<xs:attribute name="Ref" type="xs:IDREF"/>
		</xs:schema>
		 <xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
			<xs:complexType name="ArrayOfstring">
				<xs:sequence>
					<xs:element minOccurs="0" maxOccurs="unbounded" name="string" nillable="true" type="xs:string"/>
				</xs:sequence>
			</xs:complexType>
			<xs:element name="ArrayOfstring" nillable="true" type="tns:ArrayOfstring"/>
		</xs:schema>
	</wsdl:types>
  <wsdl:message name="IPostingEntityInterfaceService_GetTokenNumber_InputMessage">
    <wsdl:part name="parameters" element="tns:GetTokenNumber"/>
  </wsdl:message>
  <wsdl:message name="IPostingEntityInterfaceService_GetTokenNumber_OutputMessage">
    <wsdl:part name="parameters" element="tns:GetTokenNumberResponse"/>
  </wsdl:message>
  <wsdl:portType name="IPostingEntityInterfaceService">
    <wsdl:operation name="GetTokenNumber">
      <wsdl:input wsaw:Action="http://tempuri.org/IPostingEntityInterfaceService/GetTokenNumber" message="tns:IPostingEntityInterfaceService_GetTokenNumber_InputMessage"/>
      <wsdl:output wsaw:Action="http://tempuri.org/IPostingEntityInterfaceService/GetTokenNumberResponse" message="tns:IPostingEntityInterfaceService_GetTokenNumber_OutputMessage"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="WSHttpBinding_IPostingEntityInterfaceService" type="tns:IPostingEntityInterfaceService">
    <wsp:PolicyReference URI="#WSHttpBinding_IPostingEntityInterfaceService_policy"/>
    <soap12:binding transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="GetTokenNumber">
      <soap12:operation soapAction="http://tempuri.org/IPostingEntityInterfaceService/GetTokenNumber" style="document"/>
      <wsdl:input>
        <soap12:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap12:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
	<wsdl:service name="PostingEntityInterfaceService">
		<wsdl:port name="WSHttpBinding_IPostingEntityInterfaceService" binding="tns:WSHttpBinding_IPostingEntityInterfaceService">
			<soap:address location="https://covrapitest.sos.ca.gov/PostingEntityInterfaceService.svc"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>