lib/integrations/ca/covr/fixtures/success-min-req.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tem="http://tempuri.org/" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:ins0="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
  <s:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
         <wsa:Action>http://tempuri.org/IPostingEntityInterfaceService/GetTokenNumber</wsa:Action>
         <wsa:To>https://covrapitest.sos.ca.gov/PostingEntityInterfaceService.svc</wsa:To>
  </s:Header>
  <s:Body>
    <tem:GetTokenNumber>
    <tem:postingEntity>
                <tem:PostingAgencyKey>API_KEY</tem:PostingAgencyKey>
                <tem:CovrAgencyKey>RTV</tem:CovrAgencyKey>
                
                <tem:IsUsCitizen>1</tem:IsUsCitizen>
                <tem:IsEighteenOrOlder>1</tem:IsEighteenOrOlder>
                <tem:IsDisclosureDisplayed>1</tem:IsDisclosureDisplayed>
                
                <tem:VoterResidentType>1</tem:VoterResidentType>
                
                <tem:DobDay>1</tem:DobDay>
                <tem:DobMonth>1</tem:DobMonth>
                <tem:DobYear>1980</tem:DobYear>
                
                <tem:EthnicityId>1</tem:EthnicityId>
                <tem:ElectionMaterialLanguageId>1</tem:ElectionMaterialLanguageId>
                
             </tem:postingEntity>    
      </tem:GetTokenNumber>
  </s:Body>
</s:Envelope>