spec/fixtures/files/covr/max_registrant_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tem="http://tempuri.org/" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:ins0="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
  <s:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
         <wsa:Action>http://tempuri.org/IPostingEntityInterfaceService/GetTokenNumber</wsa:Action>
         <wsa:To>https://covrapitest.sos.ca.gov/PostingEntityInterfaceService.svc</wsa:To>
  </s:Header>
  <s:Body>
    <tem:GetTokenNumber>
    <tem:postingEntity>
                <tem:PostingAgencyKey>API_KEY</tem:PostingAgencyKey>
                <tem:CovrAgencyKey>RTV</tem:CovrAgencyKey>
                
                <tem:IsUsCitizen>1</tem:IsUsCitizen>
                <tem:IsEighteenOrOlder>1</tem:IsEighteenOrOlder>
                <tem:IsDisclosureDisplayed>1</tem:IsDisclosureDisplayed>
                
                <tem:VoterResidentType>1</tem:VoterResidentType>
                
                <tem:DobDay>5</tem:DobDay>
                <tem:DobMonth>3</tem:DobMonth>
                <tem:DobYear>1994</tem:DobYear>
                
                <tem:EthnicityId>7</tem:EthnicityId>
                <tem:ElectionMaterialLanguageId>2</tem:ElectionMaterialLanguageId>
                
                
                
                
                <tem:PrefixId>2</tem:PrefixId>
                <tem:CurrentFirstName>Susan</tem:CurrentFirstName>
                <tem:CurrentMiddleName>Brownell</tem:CurrentMiddleName>
                <tem:CurrentLastName>Anthony</tem:CurrentLastName>

                <tem:PreviousFirstName>Susana</tem:PreviousFirstName>
                <tem:PreviousMiddleName>B.</tem:PreviousMiddleName>
                <tem:PreviousLastName>Antonia</tem:PreviousLastName>

                <tem:IsHomeAddress>1</tem:IsHomeAddress>
                <tem:HomeAddressStreetLine1>123 Civil &amp; &quot;Rights&quot; Way</tem:HomeAddressStreetLine1>
                <tem:HomeAddressStreetLine2>Apt 2</tem:HomeAddressStreetLine2>
                <tem:HomeAddressCity>West &gt; Grove</tem:HomeAddressCity>
                <tem:HomeAddressState>Massachusetts</tem:HomeAddressState>
                <tem:HomeAddressZip>02134</tem:HomeAddressZip>

                <tem:IsMailingAddress>1</tem:IsMailingAddress>
                <tem:MailingAddressStreetLine1>10 Main St</tem:MailingAddressStreetLine1>
                <tem:MailingAddressStreetLine2>Box 5</tem:MailingAddressStreetLine2>
                <tem:MailingAddressCity>Adams</tem:MailingAddressCity>
                <tem:MailingAddressState>Massachusetts</tem:MailingAddressState>
                <tem:MailingAddressZip>02135</tem:MailingAddressZip>

                <tem:IsPreviouslyRegistered>1</tem:IsPreviouslyRegistered>
                <tem:PreviousAddressStreetLine1>321 Civil Wrongs Way</tem:PreviousAddressStreetLine1>
                <tem:PreviousAddressStreetLine2>#9</tem:PreviousAddressStreetLine2>
                <tem:PreviousAddressCity>Pittsburgh</tem:PreviousAddressCity>
                <tem:PreviousAddressState>Pennsylvania</tem:PreviousAddressState>
                <tem:PreviousAddressZip>15215</tem:PreviousAddressZip>

                <tem:PhoneNumber>1234567890</tem:PhoneNumber>
                <tem:EmailId>citizen@example.com</tem:EmailId>
                
                
                
             </tem:postingEntity>    
      </tem:GetTokenNumber>
  </s:Body>
</s:Envelope>